0.57.2119-1/InformationRegisters/ККСНГ_Приглашения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ККСНГ_Приглашения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>IsLocal</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SenderName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SenderKpp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SenderInn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Side</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>StatusName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AcceptionDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UserId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Login</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AbonentCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReceiverId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReceiverName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReceiverKpp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReceiverInn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Contacts</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрофильЭДООрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ККСНГ_Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникБанкаEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ3</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоговорыУВХД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорУВХД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_ЭлектронныеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/CommonModules/ККСНГ_ПриглашенияВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль работы с приглашениями
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПриглашениеКонтрагентов 

// Отправляет запросы на установку взаимосвязей контрагентов
//
// Параметры:
//   МассивИннКпп - Массив из Структура - сожержит:
//		* ИНН - Строка - ИНН контрагента
//		* КПП - Строка - КПП контрагента
//  ПараметрыАвторизации - Структура - Параметры авторизации в сервисе.
//						   Описание см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - Структура - содержит:
//			** Отправлено  - Массив из Строка - Массив успешно отправленных приглашений
//			** НеОтправлено - Массив из Строка - Массив не отправленных приглашений
//
Функция ОтправитьПриглашения(МассивИннКпп, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	МассивОтправленных = Новый Массив;
	МассивНеОтправленных = Новый Массив;
	
	Для Каждого ЭлементИннКпп Из МассивИннКпп Цикл
		RelationRequest = Новый Структура;
		RelationRequest.Вставить("ReceiverInn", ЭлементИннКпп.ИНН);
		RelationRequest.Вставить("ReceiverKpp", ЭлементИннКпп.КПП);
		RelationRequest.Вставить("Contacts", "");
		RelationRequest.Вставить("Email", "");
		RelationRequest.Вставить("ReceiverName", "");
		RelationRequest.Вставить("ReceiverId", "");
		ОтправкаПриглашенияРезультат = ККСНГ_APIКурьер.v2_RelationRequestAddRequest(ПараметрыАвторизации, RelationRequest);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОтправкаПриглашенияРезультат.Журнал, Ложь);
		Если ОтправкаПриглашенияРезультат.Успех Тогда
			МассивОтправленных.Добавить(RelationRequest);	
		Иначе
			МассивНеОтправленных.Добавить(RelationRequest);
		КонецЕсли;	
	КонецЦикла;
	
	Ответ.Успех = МассивОтправленных.Количество() > 0;
	Ответ.Результат = Новый Структура("Отправлено,НеОтправлено", МассивОтправленных, МассивНеОтправленных);
	Возврат Ответ;
	
КонецФункции

// Отправляет приглашение выбранным и зарегистрированным контрагентам
//
// Параметры:
//   ВыбранныеКонтрагенты1С - Массив - Массив контрагентов
//   ЗарегистрированныеКонтрагентыЭДО - Структура - соответствует структуре данных ClientRelation
//										(https://confluence.esphere.ru/display/SBER/ClientRelation)
//		* RelationId - Число - Идентификатор взаимосвязи
//		* Status - Структура - Статус взаимосвязи
//		* Id - Число - Идентификатор абонента
//		* Name - Строка - Краткое наименование абонента
//		* Code - Строка - Идентификатор участника ЭДО
//		* Inn - Строка - ИНН абонента
//		* Kpp - Строка - КПП (только для организации)
//   ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации - Профиль организации
//   ПараметрыАвторизации - Структура - содержит:
//		* AuthToken - Строка, Неопределено - Для способа авторизации APIKey
//		* КонтекстТокена - Строка, Неопределено - Для способа авторизации ТокенСбербанка
//		* СертификатЭП - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Для способа авторизации APIKey
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - содержит:
// 			** КоличествоВсего - Число - Количество выбранных контрагентов  
// 			** Статусы - Массив из Структура - содержит:
//				*** Контрагент - СправочникСсылка.Контрагенты
//				*** КодСтатуса - Число
//			** КоличествоОтправленных - Число - Количество успешно отправленных приглашений
//          ** КоличествоНеОтправленных - Число - Количество не отправленных приглашений
//          ** КоличествоНеЗарегистрированных - Число - Количество не зарегистрированных контрагентов в сервисе
//
Функция ПригласитьКонтрагентов(Знач ВыбранныеКонтрагенты1С, 
								Знач ЗарегистрированныеКонтрагентыЭДО, 
								Знач ПрофильЭДООрганизации, 
								ПараметрыАвторизации) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Результат = Новый Структура;
	Ответ.Результат.Вставить("КоличествоВсего", ВыбранныеКонтрагенты1С.Количество());
	Ответ.Результат.Вставить("Статусы", Новый Массив);
	Ответ.Успех = Истина;
	
	КоличествоОтправленных = 0;
	КоличествоНеОтправленных = 0;
	КоличествоНеЗарегистрированных = 0;
	
	ЗарегистрированныеКонтрагенты1С = ПолучитьЗарегистрированныхКонтрагентов1С(ПараметрыАвторизации, 
																				ЗарегистрированныеКонтрагентыЭДО, 
																				ВыбранныеКонтрагенты1С);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВыбранныеКонтрагенты.Ссылка КАК Контрагент,
	|	ВыбранныеКонтрагенты.ИНН КАК ИНН,
	|	ВыбранныеКонтрагенты.КПП КАК КПП,
	|	ВыбранныеКонтрагенты.Представление КАК Представление
	|ИЗ
	|	Справочник.Контрагенты КАК ВыбранныеКонтрагенты
	|ГДЕ
	|	ВыбранныеКонтрагенты.Ссылка В(&ВыбранныеКонтрагенты1С)";
	
	Запрос.УстановитьПараметр("ВыбранныеКонтрагенты1С", ВыбранныеКонтрагенты1С);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ИНН) Тогда
			
			Контрагент = Выборка.Контрагент;
			
			Если НЕ КонтрагентЗарегистрирован(Контрагент, ЗарегистрированныеКонтрагенты1С) Тогда
				Ответ.Успех = Ложь;
				ДобавитьСтатусНеЗарегистрированногоКонтрагента(Ответ, Контрагент);
				ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(КоличествоНеЗарегистрированных);
				Продолжить;
			КонецЕсли;
			
			ДанныеКонтрагента = Новый Структура;
			ДанныеКонтрагента.Вставить("ReceiverKpp", Выборка.КПП);
			ДанныеКонтрагента.Вставить("ReceiverInn", Выборка.ИНН);
			
			ОтправкаПриглашения = ККСНГ_APIКурьер.v2_RelationRequestAddRequest(ПараметрыАвторизации, ДанныеКонтрагента);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОтправкаПриглашения.Журнал, Ложь);
			
			Ответ.Успех = Ответ.Успех И ОтправкаПриглашения.Успех;
			Если ОтправкаПриглашения.Успех Тогда
				Ответ.Результат.Статусы.Добавить(СтатусОтправкиПриглашения(Контрагент, 0));
				ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(КоличествоОтправленных);
			ИначеЕсли ПроверитьСтатусЗарегистрированногоКонтрагента(Ответ, Контрагент, ЗарегистрированныеКонтрагенты1С) Тогда
				ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(КоличествоНеОтправленных);
			Иначе
				Ответ.Результат.Статусы.Добавить(СтатусОтправкиПриглашения(Контрагент, 1));
				ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(КоличествоНеОтправленных);
			КонецЕсли;
			
		Иначе 
			ТекстОшибки = НСтр("ru = 'У контрагента %1 не заполнен ИНН.'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Выборка.Представление);
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "RR-00002", , Контрагент);
		КонецЕсли;
		
	КонецЦикла;
	
	ПолучитьСписокПриглашений(ПрофильЭДООрганизации, ПараметрыАвторизации, РезультатЗапроса.Выгрузить());
	
	Ответ.Результат.Вставить("КоличествоОтправленных", КоличествоОтправленных);
	Ответ.Результат.Вставить("КоличествоНеОтправленных", КоличествоНеОтправленных);
	Ответ.Результат.Вставить("КоличествоНеЗарегистрированных", КоличествоНеЗарегистрированных);
	
	Возврат Ответ;

КонецФункции

// Возвращает список приглашений с сервиса и записывает в базу
//
// Параметры:
//   ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации - Профиль организации
//   ПараметрыАвторизации - Структура - содержит:
//		* AuthToken - Строка, Неопределено - Для способа авторизации APIKey
//		* КонтекстТокена - Строка, Неопределено - Для способа авторизации ТокенСбербанка
//		* СертификатЭП - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Для способа авторизации APIKey
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//	НовыеКонтрагенты - ТаблицаЗначений - содержит:
//		* ИНН - Строка - ИНН приглашаемого контрагента
//		* КПП - Строка - КПП приглашаемого контрагента
//		* Контрагент - СправочникСсылка.Контрагенты - Приглашаемый контрагент
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//   	* Результат - Структура - содержит:
//			** КоличествоПолученных - Число
//			** ИнформацияПоНовымПрофилям - Строка - Список контрагентов
//			** КоличествоНовыхПрофилей - Число
//			** КоличествоНовыхПриглашений - Число
//			** КоличествоЗаписанных - Число
//			** КоличествоПолученных - Число
//
Функция ПолучитьСписокПриглашений(Знач ПрофильЭДООрганизации, ПараметрыАвторизации, НовыеКонтрагенты = Неопределено) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();

	ЗапросПриглашений = ККСНГ_APIКурьер.v2_RelationRequestListRequest(ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПриглашений.Журнал, Ложь);
	Ответ.Успех = ЗапросПриглашений.Успех;

	Если Ответ.Успех Тогда
		
		Приглашения = ЗапросПриглашений.Результат.RelationRequestDetails;
		
		ОчиститьОтозванныеПриглашенияЛокально(Приглашения, ПрофильЭДООрганизации);
		
		Ответ.Результат = Новый Структура;
		Ответ.Результат.Вставить("КоличествоПолученных", Приглашения.Количество());
		Ответ.Результат.Вставить("ИнформацияПоНовымПрофилям", "");
		Ответ.Результат.Вставить("КоличествоНовыхПрофилей", 0);
		Ответ.Результат.Вставить("КоличествоНовыхПриглашений", 0);
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получено приглашений: " 
																+ XMLСтрока(Приглашения.Количество()));
		КоличествоЗаписанных = 0;
		Если Приглашения.Количество() > 0 Тогда
			
			УстановитьКонтрагентаПолучателя(Приглашения, НовыеКонтрагенты, ПрофильЭДООрганизации, Ответ, КоличествоЗаписанных);

			ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Записано приглашений: " 
																+ XMLСтрока(КоличествоЗаписанных) 
																	+ " из " + XMLСтрока(Приглашения.Количество()));														
		КонецЕсли;
		Ответ.Результат.Вставить("КоличествоЗаписанных", КоличествоЗаписанных);
		
		РезультатОбработки = СоздатьПрофилиПринятыхПриглашений(ПрофильЭДООрганизации, Приглашения, ПараметрыАвторизации);
		
		Ответ.Результат.ИнформацияПоНовымПрофилям = РезультатОбработки.ИнформацияПоНовымПрофилям;
		Ответ.Результат.КоличествоНовыхПрофилей = РезультатОбработки.КоличествоНовыхПрофилей;
		
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

// Проверяет наличие контрагентов в сервисе 
//
// Параметры:
//   ПараметрыАвторизации - Структура - содержит:
//		* AuthToken - Строка, Неопределено - Для способа авторизации APIKey
//		* КонтекстТокена - Строка, Неопределено - Для способа авторизации ТокенСбербанка
//		* СертификатЭП - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Для способа авторизации APIKey
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//	 ВыбранныеКонтрагенты1С - Массив - Массив контрагентов, который проверяется на наличие в сервисе Курьер
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//   	* Результат - Структура - содержит:
//   		** ЗарегистрированныеКонтрагентыЭДО - Структура - соответствует структуре данных ClientRelation
//												  (https://confluence.esphere.ru/display/SBER/ClientRelation)
//				*** RelationId - Число - Идентификатор взаимосвязи
//				*** Status - Структура - Статус взаимосвязи
//				*** Id - Число - Идентификатор абонента
//				*** Name - Строка - Краткое наименование абонента
//				*** Code - Строка - Идентификатор участника ЭДО
//				*** Inn - Строка - ИНН абонента
//				*** Kpp - Строка - КПП (только для организации)
//
Функция КонтрагентыЗарегистрированыВКурьере(ПараметрыАвторизации, ВыбранныеКонтрагенты1С) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Успех = Ложь;
	Ответ.Результат = Новый Структура();
	
	ArrayOfClientDiscovery = Новый Структура("ClientDiscovery", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка В(&ВыбранныеКонтрагенты1С)";
	
	Запрос.УстановитьПараметр("ВыбранныеКонтрагенты1С", ВыбранныеКонтрагенты1С);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПроверитьДанныеКонтрагента(Ответ, Выборка.Контрагент, Выборка.ИНН);
		
		ClientDiscovery = Новый Структура;
		ClientDiscovery.Вставить("inn", Выборка.ИНН);
		ClientDiscovery.Вставить("kpp", Выборка.КПП);
		
		ArrayOfClientDiscovery.ClientDiscovery.Добавить(ClientDiscovery);
		
	КонецЦикла;
	
	РезультатПоиска = ККСНГ_APIКурьер.v2_ClientDiscover(ПараметрыАвторизации, ArrayOfClientDiscovery);		
	
	Если НЕ РезультатПоиска.Успех Тогда
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, РезультатПоиска.Журнал, Ложь);
	Иначе
		Ответ.Результат.Вставить("ЗарегистрированныеКонтрагентыЭДО", РезультатПоиска.Результат.ClientRelation);
		Ответ.Успех = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Добавляет/изменяет запись об отправителе в регистре сведений "Приглашения"
//
// Параметры:
//   ИдентификаторПриглаешения - Строка - Идентификатор приглашения
//   ПрофильОрганизацииЭДО - СправочникСсылка.ККСНГ_Организации - Профиль организации ЭДО
//	 Контрагент - СправочникСсылка.Контаргенты - Контрагент-отправитель
//
// Возвращаемое значение:
//   Ответ - Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//
Функция ЗаписатьКонтрагентаОтправителя(ИдентификаторПриглашения, ПрофильОрганизацииЭДО, Контрагент) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Запись приглашения контрагента");
	
	Попытка
		
		МенеджерЗаписи = РегистрыСведений.ККСНГ_Приглашения.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ПрофильЭДООрганизации = ПрофильОрганизацииЭДО;
		МенеджерЗаписи.Id = ИдентификаторПриглашения;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.КонтрагентОтправитель = Контрагент;	
			МенеджерЗаписи.Записать();				
		КонецЕсли;
		
		Ответ.Успех = Истина;
		
	Исключение
		Ответ.Успех = Ложь;		
	КонецПопытки;	

	Возврат Ответ;
	
КонецФункции

// Отправляет запросы на удаление отправленных приглашений
//
// Параметры:
//  МассивИд - Массив из Строка - Массив идентификаторов удаляемых приглашений
//  ПараметрыАвторизации - Структура - Параметры авторизации в сервисе.
//						   Описание см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - Структура - содержит:
//			** Удалено  - Массив из Строка - Массив успешно удаленных приглашений
//			** НеУдалено - Массив из Строка - Массив не удаленных приглашений
//
Функция УдалитьПриглашения(МассивИд, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	МассивУдаленных = Новый Массив;
	МассивНеУдаленных = Новый Массив;
	
	Для Каждого Ид Из МассивИд Цикл
		УдалениеПриглашенияРезультат = ККСНГ_APIКурьер.v2_RelationRequestDeleteRequest(ПараметрыАвторизации, Ид);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, УдалениеПриглашенияРезультат.Журнал, Ложь);
		Если УдалениеПриглашенияРезультат.Успех Тогда
			МассивУдаленных.Добавить(Ид);	
		Иначе
			МассивНеУдаленных.Добавить(Ид);
		КонецЕсли;	
	КонецЦикла;
	
	Ответ.Успех = МассивУдаленных.Количество() > 0;
	Ответ.Результат = Новый Структура("Удалено,НеУдалено", МассивУдаленных, МассивНеУдаленных);
	Возврат Ответ;
	
КонецФункции


#КонецОбласти

#Область ОтзывПриглашения

// Отзывает отправленные приглашения
//
// Параметры:
//   ИДПриглашений - Массив из Строка - Массив идентификаторов приглашений
//   ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации - Профиль организации
//   ПараметрыАвторизации - Структура - содержит:
//		* AuthToken - Строка, Неопределено - Для способа авторизации APIKey
//		* КонтекстТокена - Строка, Неопределено - Для способа авторизации ТокенСбербанка
//		* СертификатЭП - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Для способа авторизации APIKey
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - содержит:
// 			** КоличествоВсего - Число - Количество выбранных приглашений  
// 			** КоличествоОтозванных - Число - Количество успешно отозванных приглашений  
//
Функция ОтозватьПриглашение(ИДПриглашений, Знач ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Результат = Новый Структура;
	Ответ.Результат.Вставить("КоличествоВсего", ИДПриглашений.Количество());
	Ответ.Успех = Истина;
	
	КоличествоОтозванных = 0;
	Для каждого ТекИД Из ИДПриглашений Цикл
		ОтзывПриглашения = ККСНГ_APIКурьер.v2_RelationRequestDeleteRequest(ПараметрыАвторизации, ТекИД);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОтзывПриглашения.Журнал, Ложь);
		
		Если ОтзывПриглашения.Успех Тогда
			ПриглашенияУдалено = УдалитьПриглашение(ПрофильЭДООрганизации, ТекИД);
			Если Не ПриглашенияУдалено.Успех Тогда
				ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ПриглашенияУдалено.Журнал, Ложь);
			КонецЕсли;
		КонецЕсли;
	
		Ответ.Успех = Ответ.Успех И ОтзывПриглашения.Успех;
		Если ОтзывПриглашения.Успех Тогда
			КоличествоОтозванных = КоличествоОтозванных + 1;
		КонецЕсли;
	КонецЦикла; 
	Ответ.Результат.Вставить("КоличествоОтозванных", КоличествоОтозванных);
		
	Возврат Ответ;

КонецФункции

#КонецОбласти

#Область ПринятиеПриглашений

// Принимает запрос на установку взаимосвязи контрагентов
//
// Параметры:
//   МассивИд - Массив из Строка - Массив идентификаторов приглашений
//   ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации - Профиль организации
//   ПараметрыАвторизации - Структура - содержит:
//		* AuthToken - Строка, Неопределено - Для способа авторизации APIKey
//		* КонтекстТокена - Строка, Неопределено - Для способа авторизации ТокенСбербанка
//		* СертификатЭП - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Для способа авторизации APIKey
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - содержит:
// 			** КоличествоВсего - Число - Количество выбранных приглашений  
// 			** КоличествоПринятых - Число - Количество успешно принятых приглашений  
//
Функция ПринятьПриглашения(МассивИд, Знач ПрофильОрганизацииЭДО, ПараметрыАвторизации) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Результат = Новый Структура;
	Ответ.Результат.Вставить("КоличествоВсего", МассивИд.Количество());
	Ответ.Успех = Истина;
	
	КоличествоПринятых = 0;
	Для каждого ТекИД Из МассивИд Цикл
		ПринятиеПриглашения = ККСНГ_APIКурьер.v2_RelationRequestAccept(ПараметрыАвторизации, ТекИД);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ПринятиеПриглашения.Журнал, Ложь);
		
		Ответ.Успех = Ответ.Успех И ПринятиеПриглашения.Успех;
		Если ПринятиеПриглашения.Успех Тогда
			УстановитьСтатусПриглашенияПринят(ПрофильОрганизацииЭДО, ТекИД);
			КоличествоПринятых = КоличествоПринятых + 1;
		КонецЕсли;
	КонецЦикла; 
	Ответ.Результат.Вставить("КоличествоПринятых", КоличествоПринятых);
		
	Возврат Ответ;

КонецФункции

// Выполняет создание профилей контрагентов для принятых приглашений 
//
// Параметры:
//   ИДПриглашений - Массив из Строка - Массив идентификаторов приглашений
//	 ТаблицаПриглашений - ТаблицаЗначений - содержит:
//		* SenderInn - Число
//		* SenderKpp - Число
//		* SenderName - Строка
//		* Id - Число
//		* Профиль - СправочникСсылка.ККСНГ_Контрагенты
//		* Контрагент - СправочникСсылка.Контрагенты
//		* Обрабатывать - Булево
//   ПараметрыАвторизации - Структура - содержит:
//		* AuthToken - Строка, Неопределено - Для способа авторизации APIKey
//		* КонтекстТокена - Строка, Неопределено - Для способа авторизации ТокенСбербанка
//		* СертификатЭП - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Для способа авторизации APIKey
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//   ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации - Профиль организации
//
// Возвращаемое значение:
//   Структура - содержит:
// 		* ИДПриглашений - Массив из Число - Массив идентификаторов обработанных приглашений  
// 		* ИнформацияПоНовымПрофилям - Строка - Список контрагентов обработанных приглашений
// 		* КоличествоНовыхПрофилей - Число - Количество успешно обработанных приглашений  
//
Функция ОбработатьДанныеПриглашенийЗарегистрированныхКонтрагентовЭДО(ИДПриглашений, ТаблицаПриглашений, ПараметрыАвторизации, ПрофильЭДООрганизации) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗ.SenderInn КАК Inn,
	|	ТЗ.SenderKpp КАК Kpp,
	|	ТЗ.SenderName КАК Name,
	|	ТЗ.Id КАК Id,
	|	ТЗ.Профиль КАК Профиль,
	|	ТЗ.Контрагент КАК Контрагент,
	|	ТЗ.Обрабатывать КАК Обработать
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Inn КАК Inn,
	|	ТЗ.Kpp КАК Kpp,
	|	ТЗ.Name КАК Name,
	|	ТЗ.Id КАК Id,
	|	ТЗ.Профиль КАК Профиль,
	|	ТЗ.Контрагент КАК Контрагент,
	|	ТЗ.Обработать КАК Обработать
	|ИЗ
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.Id В(&ИДПриглашений)";

	Запрос.УстановитьПараметр("ТЗ", ТаблицаПриглашений);
	Запрос.УстановитьПараметр("ИДПриглашений", ИДПриглашений);

	Результат =  Запрос.Выполнить().Выгрузить();
	
	Результат.Колонки.Добавить("Code", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(47)));
	
	РезультатОтвет = Новый Структура;
	РезультатОтвет.Вставить("ИДПриглашений", Новый Массив);
	РезультатОтвет.Вставить("ИнформацияПоНовымПрофилям", "");
	РезультатОтвет.Вставить("КоличествоНовыхПрофилей", 0);
	
	Если Результат.Количество() > 0 Тогда
	
		МассивДанныхКонтрагентов = МассивДанныхКонтрагентов(Результат);
		Ответ = ККСНГ_APIКурьер.v2_ClientDiscover(ПараметрыАвторизации, МассивДанныхКонтрагентов.ДанныеClientDiscovery);
		ВзаимосвязиКонтрагентов = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Ответ.Результат, "ClientRelation", Новый Массив);
		
		Если Ответ.Успех Тогда
			
			Для каждого ВзаимосвязьКонтрагента Из ВзаимосвязиКонтрагентов Цикл
				
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Inn", ВзаимосвязьКонтрагента.Inn);
				Если ЗначениеЗаполнено(ВзаимосвязьКонтрагента.Kpp) Тогда
					СтруктураПоиска.Вставить("Kpp", ВзаимосвязьКонтрагента.Kpp);
				КонецЕсли;
				РезультатПоиска = Результат.НайтиСтроки(СтруктураПоиска);
				Если РезультатПоиска.Количество() > 0 Тогда
					РезультатПоиска[0].Code = ВзаимосвязьКонтрагента.Code;	
				КонецЕсли;
				
			КонецЦикла;
			
			Для каждого ТекущийКонтрагент Из Результат Цикл
				Если ТекущийКонтрагент.Обработать И ОбработатьКонтрагента(ТекущийКонтрагент, ПрофильЭДООрганизации) Тогда
					РезультатОтвет.ИДПриглашений.Добавить(ТекущийКонтрагент.Id);
					РезультатОтвет.ИнформацияПоНовымПрофилям = РезультатОтвет.ИнформацияПоНовымПрофилям + Символы.ПС + ТекущийКонтрагент.Контрагент;
					РезультатОтвет.КоличествоНовыхПрофилей = РезультатОтвет.КоличествоНовыхПрофилей + 1;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат РезультатОтвет;	
	
КонецФункции

#КонецОбласти

#Область ОтклонениеПриглашений

// Отклоняет приглашения на установление взаимосвязи
//
// Параметры:
//   ИДПриглашений - Массив из Строка - Массив идентификаторов приглашений
//   ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации - Профиль организации
//   ПараметрыАвторизации - Структура - содержит:
//		* AuthToken - Строка, Неопределено - Для способа авторизации APIKey
//		* КонтекстТокена - Строка, Неопределено - Для способа авторизации ТокенСбербанка
//		* СертификатЭП - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Для способа авторизации APIKey
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - содержит:
// 			** КоличествоВсего - Число - Количество выбранных приглашений  
// 			** КоличествоОтклоненных - Число - Количество успешно отклоненных приглашений  
//
Функция ОтклонитьПриглашения(МассивИд, Знач ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Результат = Новый Структура;
	Ответ.Результат.Вставить("КоличествоВсего", МассивИд.Количество());
	Ответ.Успех = Истина;
	
	КоличествоОтклоненных = 0;
	Для каждого ТекИД Из МассивИд Цикл
		ОтклонениеПриглашения = ККСНГ_APIКурьер.v2_RelationRequestReject(ПараметрыАвторизации, ТекИД);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОтклонениеПриглашения.Журнал, Ложь);
		
		Ответ.Успех = Ответ.Успех И ОтклонениеПриглашения.Успех;
		Если ОтклонениеПриглашения.Успех Тогда
			КоличествоОтклоненных = КоличествоОтклоненных + 1;
		КонецЕсли;
	КонецЦикла; 
	Ответ.Результат.Вставить("КоличествоОтклоненных", КоличествоОтклоненных);
		
	Возврат Ответ;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает массив выбранных контрагентов приглашений
//
// Параметры:
//   ПолучателиПриглашений - ДанныеФормыКоллекция - содержит:
//		* ОтправлятьПометка - Булево - Пометка выбора контрагента
//		* Контрагент - СправочникСсылка.Контрагенты - Ссылка на контрагента
//
// Возвращаемое значение:
//   Массив - Выбранные контрагенты из списка контрагентов на форме
//   
Функция ПолучитьВыбранныхКонтрагентов1С(Знач ПолучателиПриглашений) Экспорт
	
	ВыбранныеКонтрагенты1С = ПолучателиПриглашений.Выгрузить(Новый Структура("ОтправлятьПометка", Истина), "Контрагент").ВыгрузитьКолонку("Контрагент");
	
	Возврат ВыбранныеКонтрагенты1С;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МассивДанныхКонтрагентов(ТЗ)

	МассивДанныхКонтрагентов = Новый Массив;
	ТаблицаID = Новый ТаблицаЗначений;
	ТаблицаID.Колонки.Добавить("Inn", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12)));
	ТаблицаID.Колонки.Добавить("Kpp", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(9)));
	ТаблицаID.Колонки.Добавить("Id", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(20, 0, ДопустимыйЗнак.Неотрицательный)));
	
	Для каждого Выборка Из ТЗ Цикл
	
		ДанныеПоКонтрагентам = Новый Структура;
		ДанныеПоКонтрагентам.Вставить("inn", Выборка.Inn);
		ДанныеПоКонтрагентам.Вставить("kpp", Выборка.Kpp);
		МассивДанныхКонтрагентов.Добавить(ДанныеПоКонтрагентам);
		
		НоваяСтрока = ТаблицаID.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	
	КонецЦикла;
	
	ДанныеClientDiscovery = Новый Структура;
	ДанныеClientDiscovery.Вставить("ClientDiscovery", МассивДанныхКонтрагентов);
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеClientDiscovery", ДанныеClientDiscovery);
	Результат.Вставить("ТаблицаID", ТаблицаID);
	
	Возврат Результат;

КонецФункции

Функция СоздатьПрофилиПринятыхПриглашений(ПрофильЭДООрганизации, Приглашения, ПараметрыАвторизации)

	Результат = Новый Структура;
	Результат.Вставить("ИнформацияПоНовымПрофилям", "");
	Результат.Вставить("КоличествоНовыхПрофилей", 0);
	
	МассивТекущихID = Новый Массив;
	МассивДанныхКонтрагентов = Новый Массив;
	
	Для каждого ТекПриглашение Из Приглашения Цикл
		МассивТекущихID.Добавить(ТекПриглашение.Id);
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрСведенийККСНГ_Приглашения.Id КАК Id,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverInn КАК ReceiverInn,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverKpp КАК ReceiverKpp,
	|	РегистрСведенийККСНГ_Приглашения.AbonentCode КАК Code,
	|	РегистрСведенийККСНГ_Приглашения.КонтрагентПолучатель КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.ККСНГ_Контрагенты.пустаяСсылка) КАК Профиль
	|ИЗ
	|	РегистрСведений.ККСНГ_Приглашения КАК РегистрСведенийККСНГ_Приглашения
	|ГДЕ
	|	НЕ РегистрСведенийККСНГ_Приглашения.Id В (&МассивТекущихID)
	|	И РегистрСведенийККСНГ_Приглашения.ПрофильЭДООрганизации = &ПрофильЭДООрганизации";
	Запрос.УстановитьПараметр("МассивТекущихID", МассивТекущихID);
	Запрос.УстановитьПараметр("ПрофильЭДООрганизации", ПрофильЭДООрганизации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеПоКонтрагентам = Новый Структура;
		ДанныеПоКонтрагентам.Вставить("inn", Выборка.ReceiverInn);
		ДанныеПоКонтрагентам.Вставить("kpp", Выборка.ReceiverKpp);
		МассивДанныхКонтрагентов.Добавить(ДанныеПоКонтрагентам);
	КонецЦикла;

	ДанныеClientDiscovery = Новый Структура;
	ДанныеClientDiscovery.Вставить("ClientDiscovery", МассивДанныхКонтрагентов);
	Ответ = ККСНГ_APIКурьер.v2_ClientDiscover(ПараметрыАвторизации, ДанныеClientDiscovery);
	Если Ответ.Успех Тогда
		
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("Code", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(47)));
		ТаблицаДанных.Колонки.Добавить("Inn", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12)));
		ТаблицаДанных.Колонки.Добавить("Kpp", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(9)));
		ТаблицаДанных.Колонки.Добавить("Name", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255)));
		ТаблицаДанных.Колонки.Добавить("Id", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(20, 0, ДопустимыйЗнак.Неотрицательный)));
		
		Для каждого ТекущееСостояние Из Ответ.Результат.ClientRelation Цикл
			Если Нрег(ТекущееСостояние.Status) = "exists" Тогда
				НоваяСтрока = ТаблицаДанных.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущееСостояние);				
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаДанных = ДополнитьТаблицуКонтрагентов(ТаблицаДанных, ПрофильЭДООрганизации);
		
		Для каждого ТекущийКонтрагент Из ТаблицаДанных Цикл
			ПрофильСоздан = ОбработатьКонтрагента(ТекущийКонтрагент, ПрофильЭДООрганизации);
			Если ПрофильСоздан Тогда
				Результат.ИнформацияПоНовымПрофилям = Результат.ИнформацияПоНовымПрофилям + Символы.ПС + ТекущийКонтрагент.Контрагент;
				Результат.КоличествоНовыхПрофилей = Результат.КоличествоНовыхПрофилей + 1;
				УстановитьСтатусПриглашенияПринят(ПрофильЭДООрганизации, ТекущийКонтрагент.Id);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДополнитьТаблицуКонтрагентов(ТаблицаДанных, ПрофильЭДООрганизации)

	Запрос = Новый Запрос;
	Запрос.Текст =
 	"ВЫБРАТЬ
 	|	ТЗ.Inn КАК Inn,
 	|	ТЗ.Kpp КАК Kpp,
 	|	ТЗ.Code КАК Code
 	|ПОМЕСТИТЬ ТЗ
 	|ИЗ
 	|	&ТаблицаДанных КАК ТЗ
 	|;
 	|
 	|////////////////////////////////////////////////////////////////////////////////
 	|ВЫБРАТЬ
 	|	РегистрСведенийККСНГ_Приглашения.Id КАК Id,
 	|	ТЗ.Code КАК Code,
 	|	МАКСИМУМ(ВЫБОР
 	|			КОГДА РегистрСведенийККСНГ_Приглашения.КонтрагентПолучатель ЕСТЬ NULL
 	|					ИЛИ РегистрСведенийККСНГ_Приглашения.КонтрагентПолучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
 	|				ТОГДА Контрагенты.Ссылка
 	|			ИНАЧЕ РегистрСведенийККСНГ_Приглашения.КонтрагентПолучатель
 	|		КОНЕЦ) КАК Контрагент,
 	|	МАКСИМУМ(ВЫБОР
 	|			КОГДА ККСНГ_Контрагенты.Ссылка ЕСТЬ NULL
 	|				ТОГДА ЗНАЧЕНИЕ(Справочник.ККСНГ_Контрагенты.ПустаяСсылка)
 	|			ИНАЧЕ ККСНГ_Контрагенты.Ссылка
 	|		КОНЕЦ) КАК Профиль
 	|ИЗ
 	|	ТЗ КАК ТЗ
 	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ККСНГ_Приглашения КАК РегистрСведенийККСНГ_Приглашения
 	|		ПО ТЗ.Inn = РегистрСведенийККСНГ_Приглашения.ReceiverInn
 	|			И ТЗ.Kpp = РегистрСведенийККСНГ_Приглашения.ReceiverKpp
 	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
 	|		ПО ТЗ.Code = ККСНГ_Контрагенты.КодУчастникаЭДО
 	|			И (НЕ ККСНГ_Контрагенты.ПометкаУдаления)
 	|			И (ККСНГ_Контрагенты.Владелец = &ПрофильЭДООрганизации)
 	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
 	|		ПО ТЗ.Inn = Контрагенты.ИНН
 	|			И ТЗ.Kpp = Контрагенты.КПП
 	|ГДЕ
 	|	РегистрСведенийККСНГ_Приглашения.ПрофильЭДООрганизации = &ПрофильЭДООрганизации
 	|	И РегистрСведенийККСНГ_Приглашения.Side = ""sender""
 	|	И РегистрСведенийККСНГ_Приглашения.Status = ""processed""
 	|
 	|СГРУППИРОВАТЬ ПО
 	|	РегистрСведенийККСНГ_Приглашения.Id,
 	|	ТЗ.Code";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.УстановитьПараметр("ПрофильЭДООрганизации", ПрофильЭДООрганизации);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция УстановитьСтатусПриглашенияПринят(Знач ПрофильЭДООрганизации, Знач Id)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Попытка
		
		МенеджерЗаписи = РегистрыСведений.ККСНГ_Приглашения.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ПрофильЭДООрганизации = ПрофильЭДООрганизации;
		МенеджерЗаписи.Id = Id;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Status = "Accepted";	
			МенеджерЗаписи.StatusName = "Запрос принят/Взаимосвязь активна";
			МенеджерЗаписи.Записать();
		КонецЕсли;
		Ответ.Успех = Истина;
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ТекстОшибки = "Ошибка установки статуса ""Принято"" приглашения организации по Id " + Id;
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "RR-00001", ОписаниеОшибки); 		
	КонецПопытки;	
	
	Возврат Ответ;
	
КонецФункции

Функция СтатусОтправкиПриглашения(Контрагент, КодСтатуса)
	Возврат Новый Структура("Контрагент, КодСтатуса", Контрагент, КодСтатуса);	 	
КонецФункции

Функция ЗаписатьПриглашение(Знач ПрофильЭДООрганизации, 
							Знач Id, Приглашение = Неопределено, 
							Обработано = Неопределено, 
							КонтрагентПолучательСсылка = Неопределено)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Вставить("СозданоНовое", Ложь);
	
	Попытка
		
		МенеджерЗаписи = РегистрыСведений.ККСНГ_Приглашения.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ПрофильЭДООрганизации = ПрофильЭДООрганизации;
		МенеджерЗаписи.Id = Id;
		МенеджерЗаписи.Прочитать();
		
		Если Не КонтрагентПолучательСсылка = Неопределено Тогда
			МенеджерЗаписи.КонтрагентПолучатель = КонтрагентПолучательСсылка;
		КонецЕсли;				
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			МенеджерЗаписи.Счетчик = МенеджерЗаписи.Счетчик + 1;
			
			Если Обработано <> Неопределено Тогда
				МенеджерЗаписи.Обработано = Обработано;
				МенеджерЗаписи.Записать();
			Иначе	
				МенеджерЗаписи.Status = Приглашение.Status;
				МенеджерЗаписи.StatusName = Приглашение.StatusName;
				МенеджерЗаписи.Записать();				
			КонецЕсли;
			
		Иначе
			
			МенеджерЗаписи.ПрофильЭДООрганизации = ПрофильЭДООрганизации;
			МенеджерЗаписи.Id = Id;
			Если Приглашение <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Приглашение);
			КонецЕсли;
			МенеджерЗаписи.Записать();
			Ответ.СозданоНовое = Истина;
			
		КонецЕсли;
		
		Ответ.Успех = Истина;
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ТекстОшибки = "Ошибка записи приглашения организации по участнику " + ПрофильЭДООрганизации.КодУчастникаЭДО;
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "RR-00001", ОписаниеОшибки); 		
	КонецПопытки;	
	
	Возврат Ответ;
	
КонецФункции

Функция УдалитьПриглашение(Знач ПрофильЭДООрганизации, Знач Id)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Попытка
		
		МенеджерЗаписи = РегистрыСведений.ККСНГ_Приглашения.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ПрофильЭДООрганизации = ПрофильЭДООрганизации;
		МенеджерЗаписи.Id = Id;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
		Ответ.Успех = Истина;
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ТекстОшибки = "Ошибка удаления записи приглашения организации по Id " + Id;
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "RR-00001", ОписаниеОшибки); 		
	КонецПопытки;	
	
	Возврат Ответ;
	
КонецФункции	

Функция ОбработатьКонтрагента(ДанныеКонтрагента, ПрофильЭДООрганизации, ТихийРежим = Истина)

	Если ЗначениеЗаполнено(ДанныеКонтрагента.Профиль) Тогда
		
		Попытка
			Профиль = ДанныеКонтрагента.Профиль.ПолучитьОбъект();
			Профиль.КодУчастникаЭДО = ДанныеКонтрагента.Code;
			Профиль.Записать();
			Если НЕ ТихийРежим Тогда
				ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Записан профиль " + Профиль.Наименование);	
			КонецЕсли;
			Возврат Истина;
		Исключение
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;		
		КонецПопытки;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ДанныеКонтрагента.Контрагент) Тогда
			Если НЕ ТихийРежим Тогда
				ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен контрагент по ID = " + ДанныеКонтрагента.Id);
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли;
		
		Попытка
			НовыйПрофиль = Справочники.ККСНГ_Контрагенты.СоздатьЭлемент();
			НовыйПрофиль.Владелец = ПрофильЭДООрганизации;
			НовыйПрофиль.КодУчастникаЭДО = ДанныеКонтрагента.Code;
			НовыйПрофиль.Контрагент = ДанныеКонтрагента.Контрагент;
			НовыйПрофиль.Наименование = СокрЛП(ПрофильЭДООрганизации.Наименование) + " <-> " + СокрЛП(ДанныеКонтрагента.Контрагент.Наименование);
			НовыйПрофиль.ВариантНастройкиОбмена = "Использовать настройки организации";
			НовыйПрофиль.Записать();
			Если НЕ ТихийРежим Тогда
				ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан профиль " + НовыйПрофиль.Наименование);
			КонецЕсли;
			Возврат Истина;
		Исключение
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;		
		КонецПопытки;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗарегистрированныхКонтрагентов1С(ПараметрыАвторизации, Знач ЗарегистрированныеКонтрагентыЭДО, Знач ВыбранныеКонтрагенты1С)
	
	Буфер = Новый СписокЗначений;
	Буфер.ЗагрузитьЗначения(ВыбранныеКонтрагенты1С);
	КонтрагентыПроверкиРегистрации = Буфер.ВыгрузитьЗначения();	
	
	ТаблицаЗарегистрированныхКонтрагентов1С = Новый ТаблицаЗначений;
	ТаблицаЗарегистрированныхКонтрагентов1С.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаЗарегистрированныхКонтрагентов1С.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50)));
	
	Для каждого ЗарегистрированныйКонтрагентЭДО Из ЗарегистрированныеКонтрагентыЭДО Цикл
		
		ЗарегистрированныйКонтрагент1С = ККСНГ_ПринятиеКУчетуВызовСервера.НайтиКонтрагента(ЗарегистрированныйКонтрагентЭДО.Code,
																							ЗарегистрированныйКонтрагентЭДО.Inn,
																							ЗарегистрированныйКонтрагентЭДО.Kpp);
		Если ЗначениеЗаполнено(ЗарегистрированныйКонтрагент1С) Тогда
			
			СтрокаТаблицы = ТаблицаЗарегистрированныхКонтрагентов1С.Добавить();
			СтрокаТаблицы.Контрагент = ЗарегистрированныйКонтрагент1С;
			СтрокаТаблицы.Статус = СокрЛП(НРег(ЗарегистрированныйКонтрагентЭДО.Status));
			
			ИндексНайденногоКонтрагентаПроверки = КонтрагентыПроверкиРегистрации.Найти(КонтрагентыПроверкиРегистрации);
			Если НЕ ИндексНайденногоКонтрагентаПроверки = Неопределено Тогда
				КонтрагентыПроверкиРегистрации.Удалить(ИндексНайденногоКонтрагентаПроверки);							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнитьТаблицуЗарегистрированныхКонтрагентов1С(ПараметрыАвторизации, ТаблицаЗарегистрированныхКонтрагентов1С, КонтрагентыПроверкиРегистрации);	
	
	Возврат ТаблицаЗарегистрированныхКонтрагентов1С;
	
КонецФункции

Процедура ДополнитьТаблицуЗарегистрированныхКонтрагентов1С(ПараметрыАвторизации, ТаблицаЗарегистрированныхКонтрагентов1С, Знач КонтрагентыПроверкиРегистрации)
	
	Если КонтрагентыПроверкиРегистрации.Количество() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Контрагент,
			|	Контрагенты.ИНН КАК ИНН,
			|	Контрагенты.КПП КАК КПП,
			|	Контрагенты.Представление КАК Представление
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Ссылка В(&ПроверяемыеКонтрагенты1С)";
		
		Запрос.УстановитьПараметр("ПроверяемыеКонтрагенты1С", КонтрагентыПроверкиРегистрации);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
		
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("inn", Выборка.ИНН);
			СтруктураПоиска.Вставить("kpp", Выборка.КПП);
			СтруктураПоиска.Вставить("ogrn", "");
			
			ДанныеКомпанииКурьер = ККСНГ_APIКурьер.v1_FindClient(ПараметрыАвторизации, СтруктураПоиска);
			
			Если ДанныеКомпанииКурьер.Успех Тогда
				
				СтрокаТаблицы = ТаблицаЗарегистрированныхКонтрагентов1С.Добавить();
				СтрокаТаблицы.Контрагент = Выборка.Контрагент;
				СтрокаТаблицы.Статус = "rejected";
				
			КонецЕсли;			
			
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСтатусЗарегистрированногоКонтрагента(Ответ, Контрагент, ЗарегистрированныеКонтрагенты1С)
	
	ОшибкаПоСтатусу = Истина;
	ТекстОшибки = "";
	
	Если ВзаимосвязьУжеСуществует(Контрагент, ЗарегистрированныеКонтрагенты1С) Тогда
		Ответ.Результат.Статусы.Добавить(СтатусОтправкиПриглашения(Контрагент, 4));
		ТекстОшибки = НСтр("ru = 'У контрагента %1 уже существует взаимосвязь.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Контрагент);
	ИначеЕсли СуществуетАктивныйЗапросКонтрагенту(Контрагент, ЗарегистрированныеКонтрагенты1С) Тогда
		Ответ.Результат.Статусы.Добавить(СтатусОтправкиПриглашения(Контрагент, 5));
		ТекстОшибки = НСтр("ru = 'Существует запрос, направленный контрагенту %1.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Контрагент);
	ИначеЕсли ОтправительСовпадаетСПолучателем(Контрагент, ЗарегистрированныеКонтрагенты1С) Тогда
		Ответ.Результат.Статусы.Добавить(СтатусОтправкиПриглашения(Контрагент, 8));
		ТекстОшибки = НСтр("ru = 'Отправитель %1 совпадает с получателем.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Контрагент);
	ИначеЕсли СуществуетОтклоненныйЗапросКонтрагенту(Контрагент, ЗарегистрированныеКонтрагенты1С) Тогда
		Ответ.Результат.Статусы.Добавить(СтатусОтправкиПриглашения(Контрагент, 6));
		ТекстОшибки = НСтр("ru = 'Существует отклоненный запрос, направленный контрагенту %1.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Контрагент);
	ИначеЕсли СуществуетЗаблокированнаяВзаимосвязь(Контрагент, ЗарегистрированныеКонтрагенты1С) Тогда
		Ответ.Результат.Статусы.Добавить(СтатусОтправкиПриглашения(Контрагент, 9));
		ТекстОшибки = НСтр("ru = 'Уже существует взаимосвязь (заблокированная) с контрагентом %1'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Контрагент);
	ИначеЕсли ПопыткаУдалитьСуществующегоКонтрагента(Контрагент, ЗарегистрированныеКонтрагенты1С) Тогда
		Ответ.Результат.Статусы.Добавить(СтатусОтправкиПриглашения(Контрагент, 7));
		ТекстОшибки = НСтр("ru = 'Контрагент %1 уже существует в БД / Попытка добавить как несуществующий.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Контрагент);
	Иначе
		ОшибкаПоСтатусу = Ложь;
		ТекстОшибки = "";
	КонецЕсли;

	ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "RR-00002", , Контрагент);
	
	Возврат ОшибкаПоСтатусу;	
	
КонецФункции

Функция КонтрагентЗарегистрирован(Контрагент, ЗарегистрированныеКонтрагенты1С)
	Возврат ЗарегистрированныеКонтрагенты1С.НайтиСтроки(Новый Структура("Контрагент", Контрагент)).Количество() > 0;
КонецФункции

Процедура ДобавитьСтатусНеЗарегистрированногоКонтрагента(Ответ, Контрагент)
	Ответ.Результат.Статусы.Добавить(СтатусОтправкиПриглашения(Контрагент, 2));
	ТекстОшибки = НСтр("ru = '%1 ИНН %2 КПП %3 не найдена в Сервисе ЭДО'");
	ТекстОшибки = СтрШаблон(ТекстОшибки, Контрагент, Контрагент.ИНН, Контрагент.КПП);
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "RR-00002", , Контрагент);
КонецПроцедуры

Функция ВзаимосвязьУжеСуществует(Контрагент, ЗарегистрированныеКонтрагенты1С)
	ПараметрыОтбора = Новый Структура("Контрагент, Статус", Контрагент, "exists");
	Возврат ЗарегистрированныеКонтрагенты1С.НайтиСтроки(ПараметрыОтбора).Количество() > 0;
КонецФункции

Функция СуществуетАктивныйЗапросКонтрагенту(Контрагент, ЗарегистрированныеКонтрагенты1С)
	ПараметрыОтбора = Новый Структура("Контрагент, Статус", Контрагент, "sent");
	Возврат ЗарегистрированныеКонтрагенты1С.НайтиСтроки(ПараметрыОтбора).Количество() > 0;
КонецФункции

Функция СуществуетОтклоненныйЗапросКонтрагенту(Контрагент, ЗарегистрированныеКонтрагенты1С)
	ПараметрыОтбора = Новый Структура("Контрагент, Статус", Контрагент, "rejected");
	Возврат ЗарегистрированныеКонтрагенты1С.НайтиСтроки(ПараметрыОтбора).Количество() > 0;
КонецФункции

Функция ПопыткаУдалитьСуществующегоКонтрагента(Контрагент, ЗарегистрированныеКонтрагенты1С)
	ПараметрыОтбора = Новый Структура("Контрагент, Статус", Контрагент, "clientexists");
	Возврат ЗарегистрированныеКонтрагенты1С.НайтиСтроки(ПараметрыОтбора).Количество() > 0;
КонецФункции

Функция ОтправительСовпадаетСПолучателем(Контрагент, ЗарегистрированныеКонтрагенты1С)
	ПараметрыОтбора = Новый Структура("Контрагент, Статус", Контрагент, "matchclient");
	Возврат ЗарегистрированныеКонтрагенты1С.НайтиСтроки(ПараметрыОтбора).Количество() > 0;
КонецФункции

Функция СуществуетЗаблокированнаяВзаимосвязь(Контрагент, ЗарегистрированныеКонтрагенты1С)
	ПараметрыОтбора = Новый Структура("Контрагент, Статус", Контрагент, "blocked");
	Возврат ЗарегистрированныеКонтрагенты1С.НайтиСтроки(ПараметрыОтбора).Количество() > 0;
КонецФункции

Процедура ПроверитьДанныеКонтрагента(Ответ, Контрагент, КонтрагентИНН)
	
	Если НЕ ЗначениеЗаполнено(КонтрагентИНН) Тогда
		
		ТекстОшибки = НСтр("ru = 'У контрагента %1 не заполнен ИНН'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Контрагент);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "RR-00002", , Контрагент);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(Ответ.Журнал);
		
	ИначеЕсли НЕ ККСНГ_РаботаСКонтрагентамиВызовСервера.КорректныйИНН(КонтрагентИНН) Тогда
		
		ТекстОшибки = НСтр("ru = 'У контрагента %1 указан некорректный ИНН %2'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Контрагент, КонтрагентИНН);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "RR-00002", , Контрагент);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(Ответ.Журнал);
	Иначе
		Возврат;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОчиститьОтозванныеПриглашенияЛокально(Приглащения, ПрофильЭДООрганизации)
	
	НомераОтозванныхПриглашений = ПолучитьНомераОтозванныхПриглашений(Приглащения, ПрофильЭДООрганизации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|  ККСНГ_Приглашения.ПрофильЭДООрганизации КАК ПрофильЭДООрганизации,
	|  ККСНГ_Приглашения.Id КАК Id
	|ИЗ
	|  РегистрСведений.ККСНГ_Приглашения КАК ККСНГ_Приглашения
	|ГДЕ
	|  ККСНГ_Приглашения.Id В(&НомераОтозванныхПриглашений)
	|  И ККСНГ_Приглашения.ПрофильЭДООрганизации = &ПрофильЭДООрганизации";
	
	Запрос.УстановитьПараметр("НомераОтозванныхПриглашений", НомераОтозванныхПриглашений);
	Запрос.УстановитьПараметр("ПрофильЭДООрганизации", ПрофильЭДООрганизации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		УдалитьПриглашение(Выборка.ПрофильЭДООрганизации, Выборка.Id);  
	КонецЦикла; 
	
КонецПроцедуры

Функция ПолучитьНомераОтозванныхПриглашений(Приглашения, ПрофильЭДООрганизации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|  ККСНГ_Приглашения.Id КАК НомерПриглашения
	|ИЗ
	|  РегистрСведений.ККСНГ_Приглашения КАК ККСНГ_Приглашения
	|ГДЕ
	|  НЕ ККСНГ_Приглашения.Id В (&Id)
	|  И ККСНГ_Приглашения.Status = ""Processed""
	|  И ККСНГ_Приглашения.ПрофильЭДООрганизации = &ПрофильЭДООрганизации
	|  И ККСНГ_Приглашения.Side = ""Receiver""";
	
	Запрос.УстановитьПараметр("Id", ПолучитьНомераПриглашенийОжидающихПодтверждения(Приглашения));
	Запрос.УстановитьПараметр("ПрофильЭДООрганизации", ПрофильЭДООрганизации);
	
	НомераОтозванныхПриглашений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерПриглашения");
	
	Возврат НомераОтозванныхПриглашений;
	
КонецФункции

Функция ПолучитьНомераПриглашенийОжидающихПодтверждения(Приглашения)
	
	НомераПриглашений = Новый Массив;
	Для каждого Приглашение Из Приглашения Цикл
		Если НРег(СокрЛП(Приглашение.Status)) = "processed" Тогда
			НомераПриглашений.Добавить(Приглашение.Id);	
		КонецЕсли;		
	КонецЦикла;
	
	Возврат НомераПриглашений;
	
КонецФункции

Процедура УстановитьКонтрагентаПолучателя(Приглашения, НовыеКонтрагенты, ПрофильЭДООрганизации, Ответ, КоличествоЗаписанных)

	Для каждого ТекПриглашение Из Приглашения Цикл
		
		КонтрагентПолучательСсылка = Неопределено;
		Если НЕ НовыеКонтрагенты = Неопределено И НРЕГ(ТекПриглашение.side) = "sender" И НРЕГ(ТекПриглашение.status) = "processed" Тогда
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ИНН", ТекПриглашение.ReceiverInn);
			СтруктураПоиска.Вставить("КПП", ТекПриглашение.ReceiverKpp);
			РезультатПоиска = НовыеКонтрагенты.НайтиСтроки(СтруктураПоиска);
			Если РезультатПоиска.Количество() > 0 Тогда
				КонтрагентПолучательСсылка = РезультатПоиска[0].Контрагент;	
			КонецЕсли;
		КонецЕсли;
		
		ЗаписьПриглашения = ЗаписатьПриглашение(ПрофильЭДООрганизации, ТекПриглашение.Id, ТекПриглашение, , КонтрагентПолучательСсылка);
		Если ЗаписьПриглашения.Успех Тогда
			КоличествоЗаписанных = КоличествоЗаписанных + 1;
			Если ЗаписьПриглашения.СозданоНовое Тогда
				Ответ.Результат.КоличествоНовыхПриглашений = Ответ.Результат.КоличествоНовыхПриглашений + 1;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти
